src/cf/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Продажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Расчитатьстоимость(ТекущаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура Расчитатьстоимость(ТекущаяСтрока) 
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
Конецпроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Расчитатьстоимость(ТекущаяСтрока);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьАкцию(ТекущаяДата());
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАкцию(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ 
	                |	Акции.Ссылка
	                |ИЗ
	                |	Справочник.Акции КАК Акции
	                |ГДЕ
	                |	Акции.ДатаНачала <= &ДатаДокумента
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Акции.ДатаНачала УБЫВ" ;
	Запрос.УстановитьПараметр("ДатаДокумента",НачалоДня(Дата));				
	Результат = Запрос.Выполнить();				
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Акция = Выборка.Ссылка;		
	КонецЕсли;	
		     	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		ЗаполнитьАкцию(Объект.Дата);
КонецПроцедуры
